In [1]:
import pandas as pd
import numpy as np

In [3]:
ds1 = pd.Series(np.random.randn(9), 
                index = [['a', 'a', 'a', 'b', 'b', 'b', 'c','c','c'],
                        [1 , 2, 3, 1 , 2, 3, 1 , 2, 3]])

In [4]:
ds1

a  1   -0.748113
   2    1.239235
   3    0.514528
b  1    0.248911
   2   -1.769521
   3   -0.195932
c  1    1.363386
   2   -1.151955
   3    1.022326
dtype: float64

In [6]:
ds1.index

MultiIndex(levels=[['a', 'b', 'c'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 2], [0, 1, 2, 0, 1, 2, 0, 1, 2]])

In [7]:
ds1['b']

1    0.248911
2   -1.769521
3   -0.195932
dtype: float64

In [8]:
ds1['b':'c']

b  1    0.248911
   2   -1.769521
   3   -0.195932
c  1    1.363386
   2   -1.151955
   3    1.022326
dtype: float64

In [9]:
ds1['a':'b']

a  1   -0.748113
   2    1.239235
   3    0.514528
b  1    0.248911
   2   -1.769521
   3   -0.195932
dtype: float64

In [12]:
ds1.loc[['b', 'a']]

a  1   -0.748113
   2    1.239235
   3    0.514528
b  1    0.248911
   2   -1.769521
   3   -0.195932
dtype: float64

In [13]:
ds1.unstack()

          1         2         3
a -0.748113  1.239235  0.514528
b  0.248911 -1.769521 -0.195932
c  1.363386 -1.151955  1.022326

In [14]:
type(ds1.unstack())

pandas.core.frame.DataFrame

In [15]:
ds1.unstack().stack()

a  1   -0.748113
   2    1.239235
   3    0.514528
b  1    0.248911
   2   -1.769521
   3   -0.195932
c  1    1.363386
   2   -1.151955
   3    1.022326
dtype: float64

In [18]:
df1 = pd.DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                        columns = [['Mumbai', 'Mumbai', 'Delhi'],
                                  ['Red', 'Green', 'Blue']])

In [19]:
df1

    Mumbai       Delhi
       Red Green  Blue
a 1      0     1     2
  2      3     4     5
b 1      6     7     8
  2      9    10    11

In [20]:
df1.index.names = ['key1', 'key2']

In [21]:
df1

          Mumbai       Delhi
             Red Green  Blue
key1 key2
a    1         0     1     2
     2         3     4     5
b    1         6     7     8
     2         9    10    11

In [24]:
df1.columns.names = ['cities', 'colors']

In [25]:
df1

cities    Mumbai       Delhi
colors       Red Green  Blue
key1 key2
a    1         0     1     2
     2         3     4     5
b    1         6     7     8
     2         9    10    11

In [26]:
df1['Mumbai']

colors     Red  Green
key1 key2
a    1       0      1
     2       3      4
b    1       6      7
     2       9     10

In [27]:
df1['Delhi']

colors     Blue
key1 key2
a    1        2
     2        5
b    1        8
     2       11

In [28]:
df1.swaplevel('key1', 'key2')

cities    Mumbai       Delhi
colors       Red Green  Blue
key2 key1
1    a         0     1     2
2    a         3     4     5
1    b         6     7     8
2    b         9    10    11

In [29]:
df1.sort_index(level=1)

cities    Mumbai       Delhi
colors       Red Green  Blue
key1 key2
a    1         0     1     2
b    1         6     7     8
a    2         3     4     5
b    2         9    10    11

In [30]:
df1.sort_index(level=0)

cities    Mumbai       Delhi
colors       Red Green  Blue
key1 key2
a    1         0     1     2
     2         3     4     5
b    1         6     7     8
     2         9    10    11